/*В JavaScript есть семь логических операторов:

|| (ИЛИ)
||= (Оператор логического присваивания ИЛИ)

&& (И)
&&= (Оператор логического присваивания И)

! (НЕ)

?? (Оператор нулевого слияния)
??= (Оператор нулевого присваивания)

||- Традиционно в программировании ИЛИ предназначено только для манипулирования булевыми значениями:
 в случае, если какой-либо из аргументов true, он вернёт true, в противоположной ситуации возвращается false.

 &&-выполняет следующие действия:
Вычисляет операнды слева направо.
Каждый операнд преобразует в логическое значение. Если результат false то 
останавливается и возвращает исходное значение этого операнда.
Если все операнды были истинными, возвращается последний.

!-Оператор принимает один аргумент и выполняет следующие действия:
Сначала приводит аргумент к логическому типу true/false.
Затем возвращает противоположное значение.
*/
